lyxxx-web/esp-box-thorvg_demo/examples/thorvg_demo/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_THORVG_TVG_LOADER_SUPPORT=y
CONFIG_THORVG_SVG_LOADER_SUPPORT=y
CONFIG_THORVG_PNG_LOADER_SUPPORT=y
CONFIG_THORVG_JPEG_LOADER_SUPPORT=y
CONFIG_THORVG_WEBP_LOADER_SUPPORT=y
CONFIG_MMAP_FILE_SUPPORT_FORMAT=".json,.png,.tvg,.svg,.jpg,.webp"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
